In [1]:
#import all the neccessary libraries
import pandas as pd
import matplotlib.pyplot as plt
from datasets import load_dataset

#load the data 
dataset=load_dataset('lukebarousse/data_jobs')
#convert it into a dataframe 
df=dataset['train'].to_pandas()

#data cleanup 
df['job_posted_date']=pd.to_datetime(df['job_posted_date'])

c:\Users\saxen\anaconda3\envs\python_course\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [2]:
#now we want to access  the first 10 rows of 2 columns
#df.loc[:10,'col1':'col2']
df.loc[:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [6]:
#now lets calculate the median values for the salary_year_avg
#df['salary_year_avg'] means that we are accessing the salary_year_avg col from the dataframe
median_salary_year=df['salary_year_avg'].median()

In [7]:
median_salary_hour=df['salary_hour_avg'].median()

In [ ]:
#now we are going to create a new dataframe and set it equal to the original dataframe we had
df_filled=df
#now we will fill all the empty places or the na places with the median_salary_year value
#so in the new dataframe we will access the salary_year_avg col and wherever u find empty or na just fill in the median_year_salary value
df_filled['salary_year_avg'].fillna(median_salary_year)

0         115000.0
1         115000.0
2         115000.0
3         115000.0
4         115000.0
            ...
785736    115000.0
785737    115000.0
785738    115000.0
785739    115000.0
785740    115000.0
Name: salary_year_avg, Length: 785741, dtype: float64

In [10]:
#but theres a problem here this only put the median_salary_year values in the empty place but its not updated
#if we try to see the column well see the values have still not yet been updated
df_filled['salary_year_avg']

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
          ..
785736   NaN
785737   NaN
785738   NaN
785739   NaN
785740   NaN
Name: salary_year_avg, Length: 785741, dtype: float64

In [11]:
#so inorder to fix this we reassign it to the same col
df_filled['salary_year_avg']=df_filled['salary_year_avg'].fillna(median_salary_year)

In [12]:
df_filled['salary_year_avg']

0         115000.0
1         115000.0
2         115000.0
3         115000.0
4         115000.0
            ...
785736    115000.0
785737    115000.0
785738    115000.0
785739    115000.0
785740    115000.0
Name: salary_year_avg, Length: 785741, dtype: float64

In [13]:
#similarly for the salary_hour_avg
df_filled['salary_hour_avg']=df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [14]:
df_filled['salary_hour_avg']

0         45.98
1         45.98
2         45.98
3         45.98
4         45.98
          ...
785736    45.98
785737    45.98
785738    45.98
785739    45.98
785740    45.98
Name: salary_hour_avg, Length: 785741, dtype: float64

In [15]:
#now we can see the first 10 rows value of the 2 cols salary_year_avg and salary_hour_avg and this time there wont be any null or na values
df_filled.loc[:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [16]:
#so in the above step what we did was removing na values by .dropna(subset='col') method
#then we found out the median df[colname].median()
#then we created a new dataframe which is set to the original df : df_filled=df
#now we filled all the empty or na places with the help of fillna(the value u want)
#in order to see the updated values u need to reassign to the same col of the dataframe
#in order to access the first 10 rows of a particular col use df.loc[0:10,'colname']

now we will see how to remove duplicates froma dataframe

In [19]:
#we wont touch the original dataframe df therefore we create another dataframe and assign it to be equal to the orignal df and make changes in that
#lets create another df and make it equal to the df_filled dataframe
df_unique=df_filled
#now we will drop the duplicate rows
df_unique.drop_duplicates()
#to save the changes assign it to the same df
df_unique=df_unique.drop_duplicates()
df_unique

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,115000.0,45.98,Boehringer Ingelheim,None,None
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,None,115000.0,45.98,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,None,115000.0,45.98,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,115000.0,45.98,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,Data Engineer- Sr Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,None,115000.0,45.98,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
785736,Software Engineer,DevOps Engineer,Singapura,melalui Trabajo.org,Pekerjaan tetap,False,Singapore,2023-03-13 06:16:16,False,False,Singapore,None,115000.0,45.98,CAREERSTAR INTERNATIONAL PTE. LTD.,"['bash', 'python', 'perl', 'linux', 'unix', 'k...","{'os': ['linux', 'unix'], 'other': ['kubernete..."
785737,Data Analyst,CRM Data Analyst,"Bad Rodach, Jerman",melalui BeBee Deutschland,Pekerjaan tetap,False,Germany,2023-03-12 06:18:18,False,False,Germany,None,115000.0,45.98,HABA FAMILYGROUP,"['sas', 'sas', 'sql', 'excel']","{'analyst_tools': ['sas', 'excel'], 'programmi..."
785738,Business Analyst,Commercial Analyst - Start Now,Malaysia,melalui Ricebowl,Pekerjaan tetap,False,Malaysia,2023-03-12 06:32:36,False,False,Malaysia,None,115000.0,45.98,Lendlease Corporation,"['powerpoint', 'excel']","{'analyst_tools': ['powerpoint', 'excel']}"
785739,Data Engineer,"Principal Associate, Data Engineer (Remote-Eli...","Newark, New Jersey, Amerika Serikat",melalui Recruit.net,Pekerjaan tetap,False,Sudan,2023-03-12 06:32:15,False,False,Sudan,None,115000.0,45.98,Capital One,"['python', 'go', 'nosql', 'sql', 'mongo', 'she...","{'cloud': ['aws', 'snowflake', 'azure', 'redsh..."
785740,Software Engineer,AWS System Analyst,India,melalui Trigyn,Pekerjaan tetap,False,India,2023-03-13 06:16:31,False,False,India,None,115000.0,45.98,Trigyn,"['aws', 'flow']","{'cloud': ['aws'], 'other': ['flow']}"

In [20]:
#now we dont know how many duplicate rows did we drop
#to see that
print('length of original df : ' , len(df_filled))
print('length of drop duplicates df (df_unique) : ' , len(df_unique))
print('rows dropped : ' , len(df_filled)-len(df_unique))

length of original df :  785741
length of drop duplicates df (df_unique) :  785640
rows dropped :  101

In [25]:
#now we are going to drop the duplicates in a particular col that we want by drop_dupliactes(subset=['colname'])
df_unique=df_unique.drop_duplicates(subset=['job_title','company_name'])
print('length of original df : ' , len(df_filled))
print('length of drop duplicates df (df_unique) : ' , len(df_unique))
print('rows dropped : ' , len(df_filled)-len(df_unique))

length of original df :  785741
length of drop duplicates df (df_unique) :  508042
rows dropped :  277699

data management this includes the sample and the copy method

In [1]:
#import the libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

#load the data
dataset=load_dataset('lukebarousse/data_jobs')
#convert dataset into dataframe
df=dataset['train'].to_pandas()

#data cleanup
#we will access the job_posted_date col of the df 
#data is in messy format so we will convert it to a standard format
df['job_posted_date']=pd.to_datetime(df['job_posted_date'])

In [2]:
#if u want to see the first 5 rows in a dataframe use head()
df.head()

        job_title_short  ...                                    job_type_skills
0  Senior Data Engineer  ...                                               None
1          Data Analyst  ...  {'analyst_tools': ['power bi', 'tableau'], 'pr...
2         Data Engineer  ...  {'analyst_tools': ['dax'], 'cloud': ['azure'],...
3         Data Engineer  ...  {'cloud': ['aws'], 'libraries': ['tensorflow',...
4         Data Engineer  ...  {'cloud': ['oracle', 'aws'], 'other': ['ansibl...

[5 rows x 17 columns]

In [3]:
#if u want to see the last 5 rows in a dataframe use tail
df.tail()

          job_title_short  ...                                    job_type_skills
785736  Software Engineer  ...  {'os': ['linux', 'unix'], 'other': ['kubernete...
785737       Data Analyst  ...  {'analyst_tools': ['sas', 'excel'], 'programmi...
785738   Business Analyst  ...         {'analyst_tools': ['powerpoint', 'excel']}
785739      Data Engineer  ...  {'cloud': ['aws', 'snowflake', 'azure', 'redsh...
785740  Software Engineer  ...              {'cloud': ['aws'], 'other': ['flow']}

[5 rows x 17 columns]

In [ ]:
#allows you to randomly select rows or columns from a DataFrame
#we get a random value
#we can also specify the index
#here we randomly get 10 values
df.sample(10)

              job_title_short  ...                                    job_type_skills
703333           Data Analyst  ...  {'analyst_tools': ['tableau', 'excel'], 'cloud...
687618           Data Analyst  ...  {'analyst_tools': ['tableau', 'power bi'], 'cl...
115455         Data Scientist  ...  {'cloud': ['azure', 'bigquery'], 'databases': ...
543128         Data Scientist  ...  {'cloud': ['aws'], 'programming': ['python', '...
239307  Senior Data Scientist  ...  {'analyst_tools': ['tableau'], 'libraries': ['...
215961           Data Analyst  ...  {'other': ['flow'], 'programming': ['shell', '...
44446          Data Scientist  ...            {'programming': ['python', 'sql', 'c']}
463725          Data Engineer  ...  {'cloud': ['aws'], 'databases': ['mongodb'], '...
545222         Data Scientist  ...  {'analyst_tools': ['qlik'], 'cloud': ['oracle'...
391713         Data Scientist  ...  {'analyst_tools': ['tableau', 'splunk'], 'data...

[10 rows x 17 columns]

In [ ]:
#here df.sample(10) picks up 10 random samples from the df
#df.sample(10,random_state=42) random_state makes sure every time we are asking for this 10 sample random values its always the same
#eg if we randomly picked sample and we got 1-10 then always it should give us 1-10
#it always picks the same random no
#instead of 42 u can write any other no also 
 df.sample(10,random_state=42)

              job_title_short  ...                                    job_type_skills
502901   Senior Data Engineer  ...  {'cloud': ['azure'], 'other': ['git'], 'progra...
406337  Senior Data Scientist  ...  {'analyst_tools': ['looker'], 'cloud': ['bigqu...
659951          Data Engineer  ...                                               None
541593           Data Analyst  ...                                {'async': ['jira']}
425158   Senior Data Engineer  ...                        {'programming': ['python']}
183426           Data Analyst  ...  {'analyst_tools': ['tableau'], 'cloud': ['orac...
287790           Data Analyst  ...  {'analyst_tools': ['excel'], 'libraries': ['ha...
541983           Data Analyst  ...  {'analyst_tools': ['power bi', 'tableau', 'qli...
416896         Data Scientist  ...                                               None
780907          Data Engineer  ...  {'analyst_tools': ['alteryx'], 'cloud': ['orac...

[10 rows x 17 columns]

copy() method

In [ ]:
#loading the dataset
dataset=load_dataset('lukebarousse/data_jobs')
#we are creating another df and converting our original dataset into dataframe
df_original=dataset['train'].to_pandas()

In [9]:
df_original

             job_title_short  ...                                    job_type_skills
0       Senior Data Engineer  ...                                               None
1               Data Analyst  ...  {'analyst_tools': ['power bi', 'tableau'], 'pr...
2              Data Engineer  ...  {'analyst_tools': ['dax'], 'cloud': ['azure'],...
3              Data Engineer  ...  {'cloud': ['aws'], 'libraries': ['tensorflow',...
4              Data Engineer  ...  {'cloud': ['oracle', 'aws'], 'other': ['ansibl...
...                      ...  ...                                                ...
785736     Software Engineer  ...  {'os': ['linux', 'unix'], 'other': ['kubernete...
785737          Data Analyst  ...  {'analyst_tools': ['sas', 'excel'], 'programmi...
785738      Business Analyst  ...         {'analyst_tools': ['powerpoint', 'excel']}
785739         Data Engineer  ...  {'cloud': ['aws', 'snowflake', 'azure', 'redsh...
785740     Software Engineer  ...              {'cloud': ['aws'], 'other': ['flow']}

[785741 rows x 17 columns]

In [ ]:
#copy creates a copy of the dataframe
#in the above we first loaded the dataset and then 
#converted dataset into df and stored in a new dataframe
#so we did this way because if we make changes in our new df that we created
#it wont affect the original dataset whenever we modify our new dataframe
#theres another way to create a df
#df_new=df_original (new df is equal to the original dataset that we create)
#but the problem in this is that whenver we try to make changes or modify our new df
#our original df will also get affected by it and the values might get updated
#we see that id(dat_new)=id(data_original) they are referencing the same df thats why theres a problem
#therefore do:
#dataset=load_dataset('pathname')
#df_new=dataset['train'].to_pandas()

In [17]:
#so instead of doing df_new=df_original what well first do is:
#load the dataset  and convert the dataset into df and store in the new df
#now again create a new df and use the copy method to store the value
df_new=df_original.copy()

In [18]:
print('id of the df_original:   ', id(df_original))
print('id of the df_new:     ', id(df_new))
print('are the two df same:      ',  id(df_original)==id(df_new))

id of the df_original:    2172219502480
id of the df_new:      2172046963280
are the two df same:       False

In [14]:
#now we see that both the ids are different 
#so if u make changes in one df it wont affect the original df

In [15]:
'''what we did above was 
first we loaded the dataset and converted the dataset into dataframe and stored it in a variable
dataset=load_dataset('lukebarousse/dat_jobs')
df_original=dataset['train'].to_pandas()

now we will create a new dataframe which will be a copy of the original dataframe
changes made in the new dataframe will not modify the original df as we are using the copy method
copy creates a copy of the df
df_new=df_original.copy()
'''

"what we did above was \nfirst we loaded the dataset and converted the dataset into dataframe and stored it in a variable\ndataset=load_dataset('lukebarousse/dat_jobs')\ndf_original=dataset['train'].to_pandas()\n\nnow we will create a new dataframe which will be a copy of the original dataframe\nchanges made in the new dataframe will not modify the original df as we are using the copy method\ncopy creates a copy of the df\ndf_new=df_original.copy()\n"

In [20]:
#now lets try tomodify the new dataframe that we created
#what we will do is remove the nan or empty values from the salary_year_avg of the df_new and replace it with the median_salary
median_salary=df_new['salary_year_avg'].median()
#now ill fill all the empty or nan places in the salary_year_avg with the median_salary value that i just calculated
df_new['salary_year_avg']=df_new['salary_year_avg'].fillna(median_salary)
#now well get the value of the first 5 rows of the salary_year_avg from the new df
#this time all the empty or nan places got replaced with median_salary
df_new.loc[0:5,'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [21]:
'''what happened above (the code)
1.find the median of the salary_year_avg from the new df
median_salary=df_new['salary_year_avg'].median()
2.now fill all the empty places or nan values with the median_salary value
df_new['salary_year_avg']=df_new['salary_year_avg'].fillna(median_salary)
3.now well get the values of the first five rows of the salary_year_avg of the new df
df_new.loc[0:5,'salary_year_avg']
'''

"what happened above (the code)\n1.find the median of the salary_year_avg from the new df\nmedian_salary=df_new['salary_year_avg'].median()\n2.now fill all the empty places or nan values with the median_salary value\ndf_new['salary_year_avg']=df_new['salary_year_avg'].fillna(median_salary)\n3.now well get the values of the first five rows of the salary_year_avg of the new df\ndf_new.loc[0:5,'salary_year_avg']\n"